import pandas as pd

from app.domain.adapters.google import GoogleTablesAdapter
from app.domain.exceptions import GoogleTablesException


class MockOverriddenGoogleTablesAdapter(GoogleTablesAdapter):
    """Мок адаптера google таблиц"""

    @property
    def minitable_url(self) -> str:
        """URL мини-таблицы"""
        return "minitable"

    @property
    def megatable_url(self) -> str:
        """URL мега-таблицы"""
        return "megatable"

    async def load_google_sheet_to_dataframe(self, url: str) -> pd.DataFrame:
        """Загрузка google таблицы в DataFrame"""
        if url == "megatable":
            return pd.DataFrame(
                {
                    "Активна": ["", "", "", "", ""],
                    "Роль": ["", "", "", "", ""],
                    "Код": ["", "", "", "", ""],
                    "Продукт / Сервис": ["", "", "", "", ""],
                    "URL страницы": ["", "", "", "", ""],
                    "Название страницы": ["", "", "", "", ""],
                    "Комментарий для пользователей": ["", "", "", "", ""],
                    "Страница": ["", "", "", "", ""],
                    "Основная / Неосновная страница для роли": ["", "", "", "", ""],
                    "Проект / Пространство": ["", "", "", "", ""],
                    "Несколько проектов?": ["", "", "", "", ""],
                    "Ответственный": ["", "", "", "", ""],
                    "Носитель знаний": ["", "", "", "", ""],
                    "Эксперт / Методист": ["", "", "", "", ""],
                    "РП": ["", "", "", "", ""],
                    "ВП": ["", "", "", "", ""],
                    "ВП проинформирован": ["", "", "", "", ""],
                    "Кнопки поиска и edu": ["", "", "", "", ""],
                    "Талон в jira на создание кнопок": ["", "", "", "", ""],
                    "Назначено на версию": ["", "", "", "", ""],
                    "Дата выхода версии": ["", "", "", "", ""],
                    '"Справка" в продукте': ["", "", "", "", ""],
                    "Метки проставлены": ["", "", "", "", ""],
                    "Все страницы с меткой": ["", "", "", "", ""],
                    "Комментарий служебный": ["", "", "", "", ""],
                    "ID страницы из БЗ": ["", "", "", "", ""],
                }
            )
        elif url == "minitable":
            return pd.DataFrame(
                [
                    [
                        "Продукт",
                        "Ссылка на страницу wiki с БЗ",
                        "pageId",
                        "Ссылка только с pageId",
                        "Old/new",
                        "Проблемы",
                        "Доп информация",
                    ],
                    ["", "", "223777415", "", "", "", ""],
                    ["", "", "223777417", "", "", "", ""],
                    ["", "", "223777419", "", "", "", ""],
                    ["", "", "223778220", "", "", "", ""],
                    ["", "", "223779048", "", "", "", ""],
                    ["", "", "223779056", "", "", "", ""],
                    ["", "", "223779058", "", "", "", ""],
                ]
            )
        else:
            raise GoogleTablesException
